# ReferenceArrayArray Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferenceArrayArray Constructor
ReferenceArrayArray Class See Also
---
Initializes a new instance of the ReferenceArrayArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ReferenceArrayArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ReferenceArrayArray()
```

# See Also
ReferenceArrayArray Class
Autodesk.Revit.DB Namespace